amarildolacerda/homeware/clients/esp8266_dht_gas/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <WiFiManager.h>
#include <EEPROM.h>
#include <DHT.h>
#include <ArduinoOTA.h>
#include <Updater.h>
#include <espnow.h>
#include "config.h"
#include "pages.h"
#include "espnow_protocol.h"
#include "common_console.h"

static const char *TAG = "dht-gas";

static DHT *s_dht = nullptr;

static unsigned long s_last_state_update = 0;
static unsigned long s_last_telemetry_update = 0;
static unsigned long s_last_reconnect_attempt = 0;
static unsigned long s_last_espnow_send = 0;
static unsigned long s_last_espnow_pair = 0;
static unsigned long s_last_heartbeat = 0;

static bool s_gateway_connected = false;
static bool s_paired = false;
static uint8_t s_gateway_mac[6];
static uint16_t s_sequence = 0;
static uint16_t s_assigned_slot = 0;
static int s_pair_attempts = 0;
static bool s_ack_received = false;
static bool s_send_pending = false;
static bool s_espnow_ready = false;
static uint8_t s_my_mac[6];

static unsigned long s_pair_cooldown_end = 0;

enum SendState { SEND_IDLE, SEND_WAIT_ACK, SEND_RETRY_DELAY, SEND_RETRY_WAIT_ACK };
static SendState s_send_state = SEND_IDLE;
static int s_retry_count = 0;
static unsigned long s_ack_deadline = 0;
static unsigned long s_retry_deadline = 0;

static float s_temperature = 0;
static float s_humidity = 0;
static int s_gas_level = 0;
static bool s_alarm = false;
static bool s_sensor_error = false;
static bool s_dht_valid = false;
static int s_battery = 100;
static unsigned long s_start_time = 0;
static uint32_t s_espnow_tx_count = 0;
static uint32_t s_espnow_rx_count = 0;
static unsigned long s_last_send_ms = 0;

static char s_device_id[32];
static char s_device_name[32] = DEVICE_NAME;

static int s_dht_pin = DHT_PIN;
static bool s_wifi_configuration_mode = false;
static unsigned long s_wifi_config_start_time = 0;

static ESP8266WebServer s_server(80);

static uint8_t s_broadcast_mac[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

#define EEPROM_GATEWAY_MAC_ADDR 0
#define EEPROM_GATEWAY_MAC_SIZE 6
#define EEPROM_NAME_ADDR 10
#define EEPROM_NAME_MAX 48
#define EEPROM_MAGIC 0xAA

static void save_gateway_mac(const uint8_t *mac)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_GATEWAY_MAC_ADDR, EEPROM_MAGIC);
    for (int i = 0; i < 6; i++)
        EEPROM.write(EEPROM_GATEWAY_MAC_ADDR + 1 + i, mac[i]);
    EEPROM.commit();
    EEPROM.end();
}

static bool load_gateway_mac(void)
{
    EEPROM.begin(128);
    uint8_t marker = EEPROM.read(EEPROM_GATEWAY_MAC_ADDR);
    if (marker == EEPROM_MAGIC)
    {
        for (int i = 0; i < 6; i++)
            s_gateway_mac[i] = EEPROM.read(EEPROM_GATEWAY_MAC_ADDR + 1 + i);
        EEPROM.end();
        char mac_str[18];
        mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
        console.printf("[%s] Loaded gateway MAC: %s\n", TAG, mac_str);
        return true;
    }
    EEPROM.end();
    return false;
}

static void save_device_name(const char *name)
{
    EEPROM.begin(128);
    EEPROM.write(EEPROM_NAME_ADDR, 0xFF);
    for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
    {
        EEPROM.write(EEPROM_NAME_ADDR + 1 + i, name[i]);
        if (name[i] == '\0') break;
    }
    EEPROM.write(EEPROM_NAME_ADDR + EEPROM_NAME_MAX, '\0');
    EEPROM.commit();
    EEPROM.end();
}

static bool is_valid_name(const char *s)
{
    if (!s || s[0] == '\0') return false;
    for (int i = 0; s[i]; i++)
    {
        char c = s[i];
        if (c < 32 || c > 126) return false;
    }
    return true;
}

static void load_device_name(void)
{
    EEPROM.begin(128);
    uint8_t marker = EEPROM.read(EEPROM_NAME_ADDR);
    if (marker == 0xFF)
    {
        char buf[EEPROM_NAME_MAX];
        for (int i = 0; i < EEPROM_NAME_MAX - 1; i++)
        {
            buf[i] = EEPROM.read(EEPROM_NAME_ADDR + 1 + i);
            if (buf[i] == '\0') break;
        }
        buf[EEPROM_NAME_MAX - 1] = '\0';
        if (is_valid_name(buf))
        {
            strncpy(s_device_name, buf, sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
        }
    }
    EEPROM.end();
}

static bool espnow_send_heartbeat(void);

extern "C" void espnow_send_cb(uint8_t *mac, uint8_t status)
{
    (void)mac;
    (void)status;
    s_espnow_tx_count++;
}

extern "C" void espnow_recv_cb(uint8_t *mac, uint8_t *data, uint8_t len)
{
    s_espnow_rx_count++;
    if (!data || len < 1) return;

    switch (data[0])
    {
        case ESPNOW_MSG_PAIR_RESPONSE:
        {
            if (len < sizeof(espnow_pair_response_t)) return;
            espnow_pair_response_t *resp = (espnow_pair_response_t *)data;
            if (resp->status == PAIR_STATUS_OK)
            {
                mac_copy(s_gateway_mac, mac);
                s_assigned_slot = resp->assigned_slot;
                save_gateway_mac(mac);
                s_paired = true;
                s_gateway_connected = true;
                char mac_str[18];
                mac_to_str(mac, mac_str, sizeof(mac_str));
                console.printf("[%s] Paired with gateway %s slot %d\n", TAG, mac_str, s_assigned_slot);
            }
            else
            {
                console.printf("[%s] Pair response: status=%d\n", TAG, resp->status);
            }
            break;
        }
        case ESPNOW_MSG_ACK:
        {
            if (len < sizeof(espnow_ack_t)) return;
            espnow_ack_t *ack = (espnow_ack_t *)data;
            if (ack->status == PAIR_STATUS_DENIED)
            {
                s_paired = false;
                s_gateway_connected = false;
                console.printf("[%s] Gateway rejected data (denied), need re-pair\n", TAG);
            }
            else
            {
                s_gateway_connected = true;
            }
            s_ack_received = true;
            break;
        }
        case ESPNOW_MSG_NAK:
        {
            if (len < sizeof(espnow_nak_t)) return;
            espnow_nak_t *nak = (espnow_nak_t *)data;
            if (nak->reason == NAK_REASON_GATEWAY_LOST)
            {
                console.printf("[%s] Gateway lost notification (NAK), re-pairing...\n", TAG);
                s_paired = false;
                s_gateway_connected = false;
                s_pair_attempts = 0;
            }
            break;
        }
        case ESPNOW_MSG_RESTART:
        {
            if (len < sizeof(espnow_restart_t)) return;
            espnow_restart_t *rst = (espnow_restart_t *)data;
            if (mac_equal(rst->target_mac, s_my_mac))
            {
                console.printf("[%s] Restart command received, rebooting...\n", TAG);
                if (s_paired) {
                    espnow_send_heartbeat();
                    delay(50);
                }
                delay(100);
                ESP.restart();
            }
            break;
        }
    }
}


static bool espnow_init_client(void)
{
    if (esp_now_init() != 0)
    {
        console.printf("[%s] ESP-NOW init failed\n", TAG);
        return false;
    }
    esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
    esp_now_register_send_cb(espnow_send_cb);
    esp_now_register_recv_cb(espnow_recv_cb);
    s_espnow_ready = true;
    console.printf("[%s] ESP-NOW initialized\n", TAG);
    return true;
}

static bool espnow_add_peer(const uint8_t *mac)
{
    if (!s_espnow_ready) return false;
    esp_now_del_peer((uint8_t *)mac);
    int ch = WiFi.channel();
    if (ch < 1 || ch > 13) ch = 1;
    int ret = esp_now_add_peer((uint8_t *)mac, ESP_NOW_ROLE_COMBO, ch, NULL, 0);
    if (ret != 0)
    {
        char mac_str[18];
        mac_to_str(mac, mac_str, sizeof(mac_str));
        console.printf("[%s] Failed to add peer %s: %d\n", TAG, mac_str, ret);
    }
    return (ret == 0);
}

