amarildolacerda/homeware/clients/esp8266_dht_gas/src/main.cpp
    WiFiManagerParameter custom_dev_name("dev_name", "Device Name", s_device_name, 32);
    wifiManager.addParameter(&custom_dev_name);

    if (wifiManager.startConfigPortal(WIFI_CONFIG_PORTAL_SSID, WIFI_CONFIG_PORTAL_PASS))
    {
        if (strlen(custom_dev_name.getValue()) > 0 && strcmp(s_device_name, custom_dev_name.getValue()) != 0)
        {
            strncpy(s_device_name, custom_dev_name.getValue(), sizeof(s_device_name) - 1);
            s_device_name[sizeof(s_device_name) - 1] = '\0';
            save_device_name(s_device_name);
        }
        s_wifi_configuration_mode = false;
        return true;
    }

    console.printf("[%s] Configuration portal timed out\n", TAG);
    s_wifi_configuration_mode = false;
    return false;
}

enum WifiState { WIFI_IDLE, WIFI_RECONNECTING };
static WifiState s_wifi_state = WIFI_IDLE;
static unsigned long s_wifi_reconnect_deadline = 0;
static unsigned long s_last_config_attempt = 0;

static void maintain_wifi_connection(void)
{
    if (WiFi.status() == WL_CONNECTED)
    {
        s_wifi_state = WIFI_IDLE;
        return;
    }

    unsigned long now = millis();

    if (s_wifi_state == WIFI_RECONNECTING)
    {
        if (WiFi.status() == WL_CONNECTED)
        {
            console.printf("[%s] Reconnected! IP: %s\n", TAG, WiFi.localIP().toString().c_str());
            s_wifi_state = WIFI_IDLE;
            return;
        }
        if (now >= s_wifi_reconnect_deadline)
        {
            console.printf("[%s] WiFi reconnect timeout\n", TAG);
            s_wifi_state = WIFI_IDLE;
            if (now - s_last_config_attempt > 300000)
            {
                s_last_config_attempt = now;
                wifi_setup(true);
            }
        }
        return;
    }

    if (now - s_last_reconnect_attempt < 30000)
        return;
    s_last_reconnect_attempt = now;

    console.printf("[%s] WiFi disconnected. Reconnecting...\n", TAG);
    WiFi.begin();
    s_wifi_reconnect_deadline = millis() + 15000;
    s_wifi_state = WIFI_RECONNECTING;
}

static void check_config_portal_timeout(void)
{
    if (s_wifi_configuration_mode && (millis() - s_wifi_config_start_time > 600000))
    {
        console.printf("[%s] Config portal timeout. Restarting...\n", TAG);
        ESP.restart();
    }
}

static void handle_api_settings(void)
{
    if (s_server.method() == HTTP_GET)
    {
        DynamicJsonDocument doc(256);
        doc["device_name"] = s_device_name;
        JsonArray pins = doc["available_pins"].to<JsonArray>();
        String json;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        DynamicJsonDocument doc(256);
        deserializeJson(doc, s_server.arg("plain"));
        if (doc.containsKey("device_name"))
        {
            String name = doc["device_name"].as<String>();
            if (name.length() > 0)
            {
                save_device_name(name.c_str());
                strncpy(s_device_name, name.c_str(), sizeof(s_device_name) - 1);
                s_device_name[sizeof(s_device_name) - 1] = '\0';
                s_server.send(200, "application/json", "{\"ok\":true}");
                return;
            }
        }
        s_server.send(400, "application/json", "{\"error\":\"invalid\"}");
    }
}

static void serve_pgm_page(const char *page)
{
    size_t total = strlen_P(page);
    WiFiClient cl = s_server.client();
    cl.print(F("HTTP/1.1 200 OK\r\nContent-Type: text/html\r\nContent-Length: "));
    cl.print(total);
    cl.print(F("\r\nConnection: close\r\n\r\n"));
    PGM_P src = page;
    char buf[256];
    while (total > 0)
    {
        size_t chunk = total > sizeof(buf) ? sizeof(buf) : total;
        memcpy_P(buf, src, chunk);
        cl.write((const uint8_t *)buf, chunk);
        src += chunk;
        total -= chunk;
        yield();
    }
}

static void handle_root(void)
{
    serve_pgm_page(PAGE_DASHBOARD);
}

static void handle_api_state(void)
{
    String json;
    {
        JsonDocument doc;
        if (s_dht_valid) {
            doc["temperature"] = s_temperature;
            doc["humidity"] = s_humidity;
        }
        doc["gas_level"] = s_gas_level;
        doc["alarm"] = s_alarm;
        doc["battery"] = s_battery;
        doc["dht_pin"] = s_dht_pin;
        doc["dht_valid"] = s_dht_valid;
        doc["device_id"] = s_device_id;
        doc["device_name"] = s_device_name;
        doc["gateway_connected"] = s_gateway_connected;
        doc["paired"] = s_paired;
        doc["ip"] = WiFi.localIP().toString();
        doc["rssi"] = WiFi.RSSI();
        doc["uptime_s"] = (millis() - s_start_time) / 1000;
        if (s_last_send_ms) doc["last_send_s"] = (millis() - s_last_send_ms) / 1000;
        doc["gas_analog_pin"] = GAS_ANALOG_PIN;
        doc["gas_digital_pin"] = GAS_DIGITAL_PIN;
        doc["led_pin"] = LED_PIN;
        doc["gas_led_alert_pin"] = GAS_LED_ALERT_PIN;
        doc["gas_led_alarm_pin"] = GAS_LED_ALARM_PIN;
        doc["raw_analog"] = analogRead(GAS_ANALOG_PIN);
        doc["gas_digital"] = digitalRead(GAS_DIGITAL_PIN);
        doc["led_state"] = digitalRead(LED_PIN);
        doc["alert_led_state"] = digitalRead(GAS_LED_ALERT_PIN);
        doc["alarm_led_state"] = digitalRead(GAS_LED_ALARM_PIN);
        doc["slot"] = s_assigned_slot;
        doc["tx_count"] = s_espnow_tx_count;
        doc["rx_count"] = s_espnow_rx_count;
        doc["free_heap"] = ESP.getFreeHeap();
        serializeJson(doc, json);
    }
    s_server.send(200, "application/json", json);
}

static void handle_api_pin(void)
{
    if (s_server.method() == HTTP_GET)
    {
        int pin = s_server.arg("gpio").toInt();
        pinMode(pin, INPUT_PULLUP);
        int state = digitalRead(pin);
        String json;
        JsonDocument doc;
        doc["gpio"] = pin;
        doc["state"] = state;
        serializeJson(doc, json);
        s_server.send(200, "application/json", json);
    }
    else if (s_server.method() == HTTP_POST)
    {
        String body = s_server.arg("plain");
        JsonDocument doc;
        DeserializationError err = deserializeJson(doc, body);
        if (err)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid JSON\"}");
            return;
        }
        int pin = doc["gpio"] | -1;
        if (pin < 0 || pin > 16)
        {
            s_server.send(400, "application/json", "{\"error\":\"invalid gpio\"}");
            return;
        }
        int state = doc["state"] | -1;
        if (state != 0 && state != 1)
        {
            s_server.send(400, "application/json", "{\"error\":\"state must be 0 or 1\"}");
            return;
        }
        pinMode(pin, OUTPUT);
        digitalWrite(pin, state);
        String json;
        JsonDocument resp;
        resp["gpio"] = pin;
        resp["state"] = state;
        resp["status"] = "ok";
        serializeJson(resp, json);
        s_server.send(200, "application/json", json);
    }
}

static void handle_serial(char c)
{
    switch (c)
    {
    case 'R':
    case 'r':
        ESP.restart();
        break;
    case 'l':
    case 'L':
    {
        console.printf("\n--- Leitura forcada ---\n");
        read_sensors();
        console.printf("  Temperatura: %.1f C%s\n", s_temperature, s_dht_valid ? "" : " (invalido)");
        console.printf("  Umidade:     %.1f %%\n", s_humidity);
        console.printf("  Gas:         %d %%\n", s_gas_level);
        console.printf("  Alarme:      %s\n", s_alarm ? "SIM - VAZAMENTO!" : "Seguro");
        console.printf("  DHT22:       GPIO %d\n", s_dht_pin);
        console.printf("  Bateria:     %d %%\n", s_battery);
        if (s_paired)
        {
            s_last_espnow_send = 0;
            if (espnow_send_data())
                s_last_send_ms = millis();
        }
        else
        {
            console.printf("  (gateway nao pareado)\n");
        }
        console.printf("-----------------------------\n\n");
        break;
    }
    case 'u':
    case 'U':
        console.printf("\n--- OTA ---\n");
        console.printf("  Hostname: %s.local\n", s_device_id);
        console.printf("  Port:     8266 (ArduinoOTA)\n");
        console.printf("  PlatformIO CLI:\n");
        console.printf("    pio run -t upload --upload-port %s.local\n", s_device_id);
        console.printf("  espota.py:\n");
        console.printf("    espota.py -i %s.local -p 8266 -f firmware.bin\n", s_device_id);
        console.printf("-------------\n\n");
        break;
    case 't':
    case 'T':
    {
        console.printf("\n--- Teste de pinos DHT22 ---\n");
        int pin = detect_dht_pin();
        if (pin >= 0)
            console.printf("  => DHT22 no GPIO %d\n", pin);
        else
            console.printf("  => DHT22 nao encontrado\n");
        console.printf("----------------------------\n\n");
        break;
    }
    case 'p':
    case 'P':
    {
        console.printf("\n--- Par ---\n");
        s_paired = false;
        s_gateway_connected = false;
        s_pair_attempts = 0;
        console.printf("  Estado de pareamento resetado\n");
        console.printf("  Enviando requisição de par...\n");
        if (espnow_send_pair_request())
            console.printf("  Requisição enviada!\n");
        else
            console.printf("  Falha ao enviar requisição\n");
        console.printf("----------------\n\n");
        break;
    }
    case 'h':
    case 'H':
    case '?':
        console.printf("\n--- Comandos ---\n");
        console.printf("  l    - ler sensores agora\n");
        console.printf("  r    - reset\n");
        console.printf("  s    - status do dispositivo\n");
        console.printf("  t    - testar pinos do DHT22\n");
        console.printf("  p    - resetar par e tentar parear\n");
        console.printf("  u    - info OTA\n");
        console.printf("  h/?  - esta ajuda\n");
        console.printf("  Browser: http://%s\n", WiFi.localIP().toString().c_str());
        if (s_paired)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            console.printf("  Gateway: %s (slot %d)\n", mac_str, s_assigned_slot);
        }
        console.printf("  IP local: %s\n", WiFi.localIP().toString().c_str());
        console.printf("  RSSI:     %d dBm\n", WiFi.RSSI());
        console.printf("  Up:       %lu s\n", (millis() - s_start_time) / 1000);
        console.printf("----------------\n\n");
        break;
    case 's':
    case 'S':
    {
        unsigned long up = (millis() - s_start_time) / 1000;
        console.printf("\n--- Status ---\n");
        console.printf("  Dispositivo: %s\n", s_device_id);
        char mac_str[18];
        mac_to_str(s_my_mac, mac_str, sizeof(mac_str));
        console.printf("  MAC:         %s\n", mac_str);
        console.printf("  Nome:        %s\n", s_device_name);
        console.printf("  Temperatura: %.1f C%s\n", s_temperature, s_dht_valid ? "" : " (invalido)");
        console.printf("  Umidade:     %.1f %%\n", s_humidity);
        console.printf("  Gas:         %d %%\n", s_gas_level);
        console.printf("  Alarme:      %s\n", s_alarm ? "SIM" : "nao");
        console.printf("  Bateria:     %d %%\n", s_battery);
        if (s_paired)
        {
            char mac_str[18];
            mac_to_str(s_gateway_mac, mac_str, sizeof(mac_str));
            console.printf("  Gateway:     %s (slot %d) %s\n", mac_str, s_assigned_slot,
                          s_gateway_connected ? "conectado" : "desconectado");
        }
        else
        {
            console.printf("  Gateway:     nao pareado\n");
        }
        console.printf("  Browser:     http://%s\n", WiFi.localIP().toString().c_str());
        console.printf("  RSSI:        %d dBm\n", WiFi.RSSI());
        console.printf("  Uptime:      %lu s\n", up);
        console.printf("---------------\n\n");
        break;
    }
    }
}

static void handle_ota(void)
{
    if (!Update.hasError())
    {
        s_server.send(200, "application/json", "{\"status\":\"ok\"}");
        delay(500);
        ESP.restart();
    }
    else
    {
        s_server.send(500, "application/json", "{\"status\":\"error\"}");
    }
}

static void handle_ota_upload(void)
{
    HTTPUpload &upload = s_server.upload();
    if (upload.status == UPLOAD_FILE_START)
    {
        console.printf("[%s] OTA update started: %s (%d bytes)\n", TAG, upload.filename.c_str(), upload.totalSize);
        if (!Update.begin(upload.totalSize))
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_WRITE)
    {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize)
            Update.printError(Serial);
    }
    else if (upload.status == UPLOAD_FILE_END)
    {
        if (Update.end(true))
            console.printf("[%s] OTA update success: %d bytes\n", TAG, upload.totalSize);
        else
            Update.printError(Serial);
    }
}

void setup(void)
{
    Serial.begin(115200);
    delay(1000);
    console.begin();
    s_start_time = millis();

    uint32_t chip_id = ESP.getChipId();
    snprintf(s_device_id, sizeof(s_device_id), "esp8266_%06x", chip_id);

    load_device_name();

